zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32s3-pinctrl.h
/**
 * @name UART1_TX
 * @{
 */
#define UART1_TX_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO41 ESP32_PINMUX(41, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_U1TXD_OUT)
#define UART1_TX_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_U1TXD_OUT)
/** @} */

/**
 * @name UART2_CTS
 * @{
 */
#define UART2_CTS_GPIO0 ESP32_PINMUX(0, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO1 ESP32_PINMUX(1, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO2 ESP32_PINMUX(2, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO3 ESP32_PINMUX(3, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO4 ESP32_PINMUX(4, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO5 ESP32_PINMUX(5, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO6 ESP32_PINMUX(6, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO7 ESP32_PINMUX(7, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO8 ESP32_PINMUX(8, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO9 ESP32_PINMUX(9, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO10 ESP32_PINMUX(10, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO11 ESP32_PINMUX(11, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO12 ESP32_PINMUX(12, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO13 ESP32_PINMUX(13, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO14 ESP32_PINMUX(14, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO15 ESP32_PINMUX(15, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO16 ESP32_PINMUX(16, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO17 ESP32_PINMUX(17, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO18 ESP32_PINMUX(18, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO19 ESP32_PINMUX(19, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO20 ESP32_PINMUX(20, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO21 ESP32_PINMUX(21, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO26 ESP32_PINMUX(26, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO27 ESP32_PINMUX(27, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO28 ESP32_PINMUX(28, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO29 ESP32_PINMUX(29, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO30 ESP32_PINMUX(30, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO31 ESP32_PINMUX(31, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO32 ESP32_PINMUX(32, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO33 ESP32_PINMUX(33, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO34 ESP32_PINMUX(34, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO35 ESP32_PINMUX(35, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO36 ESP32_PINMUX(36, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO37 ESP32_PINMUX(37, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO38 ESP32_PINMUX(38, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO39 ESP32_PINMUX(39, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO40 ESP32_PINMUX(40, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO41 ESP32_PINMUX(41, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO42 ESP32_PINMUX(42, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO43 ESP32_PINMUX(43, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO44 ESP32_PINMUX(44, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO45 ESP32_PINMUX(45, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO46 ESP32_PINMUX(46, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO47 ESP32_PINMUX(47, ESP_U2CTS_IN, ESP_NOSIG)
#define UART2_CTS_GPIO48 ESP32_PINMUX(48, ESP_U2CTS_IN, ESP_NOSIG)
/** @} */

/**
 * @name UART2_RTS
 * @{
 */
#define UART2_RTS_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO41 ESP32_PINMUX(41, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_U2RTS_OUT)
#define UART2_RTS_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_U2RTS_OUT)
/** @} */

/**
 * @name UART2_RX
 * @{
 */
#define UART2_RX_GPIO0 ESP32_PINMUX(0, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO1 ESP32_PINMUX(1, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO2 ESP32_PINMUX(2, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO3 ESP32_PINMUX(3, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO4 ESP32_PINMUX(4, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO5 ESP32_PINMUX(5, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO6 ESP32_PINMUX(6, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO7 ESP32_PINMUX(7, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO8 ESP32_PINMUX(8, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO9 ESP32_PINMUX(9, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO10 ESP32_PINMUX(10, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO11 ESP32_PINMUX(11, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO12 ESP32_PINMUX(12, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO13 ESP32_PINMUX(13, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO14 ESP32_PINMUX(14, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO15 ESP32_PINMUX(15, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO16 ESP32_PINMUX(16, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO17 ESP32_PINMUX(17, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO18 ESP32_PINMUX(18, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO19 ESP32_PINMUX(19, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO20 ESP32_PINMUX(20, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO21 ESP32_PINMUX(21, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO26 ESP32_PINMUX(26, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO27 ESP32_PINMUX(27, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO28 ESP32_PINMUX(28, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO29 ESP32_PINMUX(29, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO30 ESP32_PINMUX(30, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO31 ESP32_PINMUX(31, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO32 ESP32_PINMUX(32, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO33 ESP32_PINMUX(33, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO34 ESP32_PINMUX(34, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO35 ESP32_PINMUX(35, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO36 ESP32_PINMUX(36, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO37 ESP32_PINMUX(37, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO38 ESP32_PINMUX(38, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO39 ESP32_PINMUX(39, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO40 ESP32_PINMUX(40, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO41 ESP32_PINMUX(41, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO42 ESP32_PINMUX(42, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO43 ESP32_PINMUX(43, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO44 ESP32_PINMUX(44, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO45 ESP32_PINMUX(45, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO46 ESP32_PINMUX(46, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO47 ESP32_PINMUX(47, ESP_U2RXD_IN, ESP_NOSIG)
#define UART2_RX_GPIO48 ESP32_PINMUX(48, ESP_U2RXD_IN, ESP_NOSIG)
/** @} */

/**
 * @name UART2_TX
 * @{
 */
#define UART2_TX_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO41 ESP32_PINMUX(41, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_U2TXD_OUT)
#define UART2_TX_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_U2TXD_OUT)
/** @} */

/**
 * @name SPIS2_CSEL
 * @{
 */
#define SPIS2_CSEL_GPIO0  ESP32_PINMUX(0, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO1  ESP32_PINMUX(1, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO2  ESP32_PINMUX(2, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO3  ESP32_PINMUX(3, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO4  ESP32_PINMUX(4, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO5  ESP32_PINMUX(5, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO6  ESP32_PINMUX(6, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO7  ESP32_PINMUX(7, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO8  ESP32_PINMUX(8, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO9  ESP32_PINMUX(9, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO10 ESP32_PINMUX(10, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO11 ESP32_PINMUX(11, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO12 ESP32_PINMUX(12, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO13 ESP32_PINMUX(13, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO14 ESP32_PINMUX(14, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO15 ESP32_PINMUX(15, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO16 ESP32_PINMUX(16, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO17 ESP32_PINMUX(17, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO18 ESP32_PINMUX(18, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO19 ESP32_PINMUX(19, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO20 ESP32_PINMUX(20, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO21 ESP32_PINMUX(21, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO26 ESP32_PINMUX(26, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO27 ESP32_PINMUX(27, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO28 ESP32_PINMUX(28, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO29 ESP32_PINMUX(29, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO30 ESP32_PINMUX(30, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO31 ESP32_PINMUX(31, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO32 ESP32_PINMUX(32, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO33 ESP32_PINMUX(33, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO34 ESP32_PINMUX(34, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO35 ESP32_PINMUX(35, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO36 ESP32_PINMUX(36, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO37 ESP32_PINMUX(37, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO38 ESP32_PINMUX(38, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO39 ESP32_PINMUX(39, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO40 ESP32_PINMUX(40, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO41 ESP32_PINMUX(41, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO42 ESP32_PINMUX(42, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO43 ESP32_PINMUX(43, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO44 ESP32_PINMUX(44, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO45 ESP32_PINMUX(45, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO46 ESP32_PINMUX(46, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO47 ESP32_PINMUX(47, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO48 ESP32_PINMUX(48, ESP_FSPICS0_IN, ESP_NOSIG)
/** @} */

/**
 * @name SPIS2_MISO
 * @{
 */
#define SPIS2_MISO_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO41 ESP32_PINMUX(41, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_FSPIQ_OUT)
/** @} */

